UT_Marketplaces.Marketplaces/src/InformationRegisters/НоменклатураЗагруженнаяНаТСД/НоменклатураЗагруженнаяНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураЗагруженнаяНаТСД</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменДаннымиМобильноеПриложение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/НоменклатураЗагруженнаяНаТСД/ManagerModule.bsl
Процедура ДобавитьНоменклатуру(Узел,Номенклатура) Экспорт
	Если Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УзелОбмена.Установить(Узел);
    НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Прочитать();
	Если НЕ НаборЗаписей.Количество() Тогда 
		Запись=НаборЗаписей.Добавить(); 
		Запись.УзелОбмена=Узел;
   		Запись.Номенклатура=Номенклатура;
		//Обмен.ЗарегистрироватьНоменклатуруИСвязанныеОбъекты(Узел,Номенклатура);
	КонецЕсли;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьНоменклатуру(Узел,Номенклатура) Экспорт
	Если Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		Возврат;
	КонецЕсли; 
	Набор=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.СоздатьНаборЗаписей();
	Набор.Отбор.УзелОбмена.Установить(Узел);
    Набор.Отбор.Номенклатура.Установить(Номенклатура);
	Набор.Записать(Истина);
	
КонецПроцедуры 

Функция ПолучитьУзлыДляНоменклатуры(Номенклатура) Экспорт 
	
	Если Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураЗагруженнаяНаТСД.УзелОбмена КАК УзелОбмена
		|ИЗ
		|	РегистрСведений.НоменклатураЗагруженнаяНаТСД КАК НоменклатураЗагруженнаяНаТСД
		|ГДЕ
		|	НоменклатураЗагруженнаяНаТСД.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивУзлов=ТЗ.ВыгрузитьКолонку("УзелОбмена");
	
	Возврат МассивУзлов;
	
КонецФункции 

Функция НоменклатураЗагружаетсяНаУзел(Номенклатура,Узел) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураЗагруженнаяНаТСД.УзелОбмена КАК УзелОбмена
		|ИЗ
		|	РегистрСведений.НоменклатураЗагруженнаяНаТСД КАК НоменклатураЗагруженнаяНаТСД
		|ГДЕ
		|	НоменклатураЗагруженнаяНаТСД.Номенклатура = &Номенклатура
		|	И НоменклатураЗагруженнаяНаТСД.УзелОбмена = &УзелОбмена";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("УзелОбмена", Узел);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат НЕ Выборка.Количество()=0;
	
КонецФункции
